In [40]:
import pandas as pd

In [41]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [42]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [43]:
df = employee.groupby('managerId')[['department']].count().reset_index()

In [44]:
df

   managerId  department
0        101           5

In [45]:
df = df[df["department"] >= 5]

In [46]:
df = employee.merge(df, left_on="id", right_on="managerId")

In [47]:
df[['name']]

   name
0  John